      PROGRAM VARIABLES
      INTEGER I !整型声明语句
      REAL F !实型声明语句
      DOUBLE PRECISION D !双精度声明语句
      COMPLEX C !复型声明语句
      LOGICAL B !逻辑型声明语句
      CHARACTER S !字符型声明语句
!整型常量
      I = -1234 !整型默认为4字节
      I = -324_8 !8字节整型。下划线加数字表示精度，只允许1,2,4,8个字节
      I = 123_1 !1字节整型
      I = 2343_2 !2字节整型
      I = 238_4 !4字节整型
!实型常量
      F = 23. !以小数点表示实型数，默认为4字节
      D = 87234.42343256_8 !8字节实型，只允许4或8个字节
      F = 32.16_4 !4字节实型
      F = 7.8E9 !指数表示（E字母）
      D = 8.2384D12 !双精度的指数表示（D字母）
!复型常量（C语言里没有的）
      C = (8.3, 98) !括号里面分别表示实部与虚部
!逻辑型常量
      B = .TRUE. !只能有.TRUE.和.FALSE.两个值
      B = .FALSE.
!字符型常量
      S = 'a'
      S = "x" !Fortran90开始允许使用双引号
      END
